SELECT [Код актора]
FROM     Анкети

SELECT [Кількість робочих годин]
FROM     Анкети
ORDER BY [Кількість робочих годин]

SELECT [Код актора], [Кількість робочих годин], [Код спектаклю], [Вартість річного контракту]
FROM     Анкети
ORDER BY [Код актора], [Кількість робочих годин] DESC

SELECT Працівники.[Код актора], Доплати.[Дата перм'єри], Працівники.[Ім'я]
FROM     Працівники INNER JOIN
                  Доплати ON Працівники.[Код актора] = Доплати.[Код головного актора]

SELECT Працівники.[Код актора], Анкети.[Код спектаклю]
FROM     Анкети INNER JOIN
                  Працівники ON Анкети.[Код актора] = Працівники.[Код актора]
WHERE  (Працівники.[Код актора] = 4)

SELECT [Зала показу], [Кількість квитків]
FROM     Доплати
WHERE  ([Зала показу] = N'2') AND ([Кількість квитків] > N'100')

SELECT Бюджет, [Дата перм'єри], [Код спекталю]
FROM     Доплати
WHERE  (Бюджет = N'2000' OR
                  Бюджет > N'2000')

SELECT Стаж, Зарплатня, Прізвище
FROM     Працівники
WHERE  (Стаж BETWEEN N'1' AND N'2')

SELECT [Код актора], Прізвище, [Ім'я]
FROM     Працівники
WHERE  ([Ім'я] LIKE N'C&')

SELECT [Код актора], Прізвище, [Ім'я]
FROM     Працівники
WHERE  ([Ім'я] LIKE N'А________')

SELECT Прізвище, [Ім'я], Зарплатня
FROM     Працівники
WHERE  ([Ім'я] LIKE N'А[^н]')

SELECT Працівники.*, Доплати.[Дата перм'єри]
FROM     Доплати INNER JOIN
                  Працівники ON Доплати.[Код головного актора] = Працівники.[Код актора]
WHERE  (Доплати.[Дата перм'єри] IS NULL)