USE Levkivska_271_основна
GO
/*CREATE VIEW VIEW3
AS
SELECT КодПрацівника, СімейнийСтан
FROM     Анкети
WHERE  (СімейнийСтан = 'неодружений') AND (ДатаНародження > '01-01-2001')
*/
CREATE VIEW VIEW4
AS
SELECT Прізвище, Посада, (Стаж+1) AS [Стаж через рік]
FROM Працівники

CREATE VIEW VIEW5
AS
SELECT КодПрацівника, AVG(Стаж) AS [Середній стаж]
FROM Працівники
GROUP BY КодПрацівника

ALTER VIEW VIEW5
AS
SELECT КодПрацівника, AVG(Стаж) AS [Середній стаж], Прізвище
FROM Працівники
GROUP BY КодПрацівника, Прізвище

CREATE VIEW VIEWDEL
AS
SELECT * 
FROM Анкети

DROP VIEW VIEWDEL

INSERT INTO dbo.VIEW1 (КодПрацівника, Прізвище, [Ім'я], Посада, ДатаПрийому, КодДоплати, Відділ)
VALUES
(18, 'Пономаренко', 'ІВан', 'Провідний юрист', '2019-06-27', 3, 'кажри'),
(19, 'Кузнецов', 'Володимир', 'Програміст', '2018-12-01', 3, 'юридичний'),
(20, 'Невідомий ', 'Іван', 'Начальник віддіду', '2017-10-10', 3, 'кадри'),
(21, 'Висоцька ', 'Анастасія', 'Інспектор', '2020-03-14', 2, 'інформаційний'),
(22, 'Майборода ', 'Данило', 'Провідний юрист', '2022-01-17', 1, 'юридичний');

UPDATE dbo.VIEW1
SET [КодДоплати] = 1
WHERE Стаж > 6

DELETE FROM dbo.VIEW1 WHERE КодПрацівника = 15

ALTER VIEW dbo.VIEW1
AS
SELECT *
FROM Працівники
WHERE КодПрацівника IN(1,3,5,7,9,11)

ALTER VIEW VIEW2
AS
SELECT Працівники.Прізвище, Працівники.[Ім'я], Анкети.СімейнийСтан
FROM     Анкети INNER JOIN
                  Працівники ON Анкети.КодПрацівника = Працівники.КодПрацівника

ALTER VIEW VIEW3
AS
SELECT КодПрацівника, СімейнийСтан
FROM     Анкети
WHERE  (СімейнийСтан = 'неодружений') AND (ДатаНародження > '01-01-2001')

SELECT VIEW1.КодПрацівника, VIEW1.Прізвище, [Доплати].ВидДоплати
FROM VIEW1 JOIN [Доплати] ON 
VIEW1.КодПрацівника = VIEW1.КодПрацівника
