USE Левківська_271_2
GO
INSERT INTO Актори ([Код актора], Прізвище, [Ім'я], Зарплатня, Стаж)
VALUES
(1, 'Левківська', 'Анастасія', 15000,10),
(2, 'Кузнецов', 'Вова', 10000, 5),
(3,'Слсарева', 'Анастасія', 15000, 10),
(4, 'Малащук', 'Костянтин', 20000, 20),
(5, 'Оніщук', 'Ілля', 6000, 2),
(6, 'Титаренко', 'Поліна', 25000, 25),
(7, 'Гульнишов', 'Микита', 10000, 5),
(8, 'Ткаченко', 'Ольга', 15000, 10),
(9, 'Кравцов', 'Назар', 20000, 20),
(10, 'Клименко', 'Анна', 10000, 5)

INSERT INTO [Зайнятість акторів]([Код актора],[Код спектаклю],[Кількість робочих годин],[Вартість річного контракту])
VALUES
(1,1, 220, 115000),
(2,2, 220, 150000),
(3,3,220, 115000),
(4,4, 220, 200000),
(5,5 ,220, 60000),
(6,6, 220, 255000),
(7,7, 220, 150000),
(8,8,220, 115000),
(9,9,220, 250000),
(10,10,220,150000)

INSERT INTO [показ спектаклю]([Код спекталю], [Дата перм'єри], [Зала показу], [Кількість квитків],Бюджет, [Код головного актора])
VALUES
(1, 29.10, 1 ,100, 10000, 1),
(2, 11,01, 2, 200, 15000, 2),
(3,15,03 ,1, 100, 15000, 3),
(4, 14,03, 2, 200, 2000, 4),
(5, 17,02, 1,100, 6000, 5),
(6, 20,08, 2, 200, 61611, 6),
(7, 18,06, 1, 100, 5000, 7),
(8, 17,04, 1, 100, 10523, 8),
(9, 29,03, 2, 200, 20666, 9),
(10, 26,11,1, 100, 554312,10)